//=====================================================================================================================
//　タイトル:	世界一簡単な関数ポインタ
//	作成者:		高橋弘宜
//=====================================================================================================================

#include <iostream>
using namespace std;

//テスト用の関数
void test_func1(int x) { cout << "関数は引数" << x << "で呼び出されました" << endl; }
void test_func2(int x) { cout << "This function called by..." << x << endl; }

int main()
{
	//==================================================================
	// 関数ポインタの定型
	//
	// 戻り値 (*変数名) (引数)
	// 戻り値 と 引数のパターンが一致する関数を変数として登録できます
	//==================================================================
	void (*func_ptr)(int) = test_func1;

	//呼び出しは、今までの関数の呼び出し方と同じでOK
	cout << "関数ポインタ(単一)" << endl;
	func_ptr(10);

	//==================================================================
	// 関数ポインタの配列
	//
	// 戻り値 (*変数名 [ 要素数 ] ) (引数)
	//==================================================================
	void(*func_array[])(int) = { test_func1, test_func2 };

	// ↑は、これとほぼおなじ
	// void(*func_array[2])(int);
	// func_array[0] = test_func1;
	// func_array[1] = test_func2;

	cout << "\n関数ポインタ(配列)" << endl;
	for(int i = 0; i < 2; ++i) { func_array[i](i * 4); }

	getchar();

	return 0;
}

